export const docItems = [
  {
    id: 1,
    name: "Устав СПб ГБУК 'Клуб 'Выборгская сторона'",
    link: "https://yadi.sk/i/lnW5m0PV8MhF1g",
    type: "Нормативные документы"
  },
  {
    id: 2,
    name: "Свидетельство о постановке на учёт в налоговом органе",
    link: "https://yadi.sk/i/fqemhKOHKrKF0g",
    type: "Нормативные документы"
  },
  {
    id: 3,
    name: "Свидетельство о государственной регистрации",
    link: "https://yadi.sk/i/rnLkDYwSlO8Ttg",
    type: "Нормативные документы"
  },
  {
    id: 4,
    name: "Стандарт работы сотрудников",
    link: "https://yadi.sk/i/Nf4SYK0A42P9IA",
    type: "Стандарты безопасной организации труда работников",
  },
  {
    id: 5,
    name: "Стандарт организации работы клубных формирований",
    link: "https://yadi.sk/i/DVrjEG9jLy8SYg",
    type: "Стандарты безопасной организации труда работников",
  },
  {
    id: 6,
    name: "Стандарт проведения культурно-досуговых мероприятий",
    link: "https://yadi.sk/i/hd6IkDJcZDLP_w",
    type: "Стандарты безопасной организации труда работников",
  },
]