import i1 from '../../images/Activity/Events/image12.png'

export const newsItems = [
  {
    _id: 1,
    images: [],
    image: i1,
    date: "Wed Sep 15 2021 14:43:00 GMT+0300",
    title: "конкурс изобразительного искусства",
    subtitle: "«Клуб «Выборгская сторона» объявляет о старте конкурса изобразительного искусства «Мы говорим за мир спасибо!» , посвящённого 76-летию со Дня Победы в Великой Отечественной войне 1941-1945 г.г.",
    description: ["В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества."],
  },
]
