import i1 from '../../images/Activity/Events/image12.png'

export const eventsItems = [
  {
    _id: 1,
    type: "event",
    image: i1,
    startTime: "Wed Sep 15 2021 23:43:00 GMT+0300",
    endTime: "Wed Sep 15 2021 23:45:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
  },
  {
    _id: 2,
    type: "event",
    image: i1,
    startTime: "Wed Sep 15 2021 23:43:00 GMT+0300",
    endTime: "Wed Sep 15 2021 23:45:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
  },
  {
    _id: 3,
    type: "event",
    image: i1,
    startTime: "Wed Sep 15 2021 23:43:00 GMT+0300",
    endTime: "Wed Sep 15 2021 23:45:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
  },
  {
    _id: 4,
    type: "event",
    image: i1,
    startTime: "Wed Sep 15 2021 23:43:00 GMT+0300",
    endTime: "Wed Sep 15 2021 23:45:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
  }

]
