import i1 from '../../images/Activity/Events/image12.png'

export const eventsItems = [
  {
    _id: 1,
    type: "festival",
    images: [],
    image: i1,
    startTime: "Wed Sep 11 2021 12:43:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
    description: ["В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества."],
  },
  {
    _id: 2,
    images: [],
    image: i1,
    startTime: "Wed Sep 15 2021 14:43:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
    description: ["В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества."],
  },
  {
    _id: 3,
    type: "festival",
    images: [],
    image: i1,
    startTime: "Tue Sep 16 2021 13:43:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
    description: ["В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества."],
  },
  {
    _id: 4,
    images: [],
    image: i1,
    startTime: "Wed Sep 22 2021 16:43:00 GMT+0300",
    title: "конкурсе «Мы парни бравые!»",
    subtitle: "В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества.",
    description: ["В СПб ГБУК «Клуб «Выборгская сторона» с 1 февраля стартует приём заявок на участие в открытом районном вокальном конкурсе «Мы парни бравые!», посвященном празднованию Дня защитника Отечества."],
  }
]
