const infoAccessible = {
  title: "В рамках государственной программы Российской Федерации «Доступная среда» в СПб ГБУК «Клуб «Выборгская сторона» проведен комплекс работ для обеспечения доступности учреждения для инвалидов и маломобильных групп населения(ММГН).",
  blocks: [
    {
      id: 1,
      title: "Перед вторым входом в здание (заднее крыльцо) имеется кнопка вызова, или телефон 542-16-34 для обращения инвалидов о помощи сопровождения к месту предоставления услуги.",
      subtitle: "",
      list: [""],
      image: "https://api.vs.didrom.ru/accessible/1.jpg",
    },
    {
      id: 2,
      title: "Для людей, передвигающихся на кресле-коляске, на заднем крыльце оборудован отдельный вход с пандусом, с кнопками вызова персонала.",
      subtitle: "",
      list: [""],
      image: "https://api.vs.didrom.ru/accessible/1.jpg",
    },
    {
      id: 3,
      title: "Ближайшая к СПб ГБУК «Клуб „Выборгская сторона“ станция метро „Выборгская“. От ст.м. „Выборгская“",
      subtitle: "",
      list: ["1. Расстояние от ст. метро составляет 440 м.", "2. Время движения пешком 5 минут.", "3. Весь путь проходит по выделенному пешеходному пути.", "4. Перекрёстки регулируемые, оборудованы таймером.", "5. На здании, где находится СПб ГБУК „Клуб“ Выборгская сторона» установлена вывеска учреждения «Клуб» Выборгская сторона», справа от входа расположена кнопка вызова персонала", "6. На пути следования от станции метро"],
      image: "https://api.vs.didrom.ru/accessible/1.jpg",
    }
  ]
}

module.exports = {
  infoAccessible,
}